src/Documents/ПланП_ПланПроизводстваНаПериод/ПланП_ПланПроизводстваНаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланП_ПланПроизводстваНаПериод</name>
  <registerRecords>InformationRegister.ПланП_ПланЗагрузкиРесурсов</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланПроизводстваПоРесурсам</name>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПроизводства</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПредприятия</name>
      <type>
        <types>CatalogRef.КлючевыеРесурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Старт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Финиш</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПланП_ПланПроизводстваНаПериод/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПланП_ПланПроизводстваНаПериод.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланП_ПланПроизводстваНаПериод.Дата,
	|	ПланП_ПланПроизводстваНаПериод.НачалоПериода,
	|	ПланП_ПланПроизводстваНаПериод.Номер,
	|	ПланП_ПланПроизводстваНаПериод.ОкончаниеПериода,
	|	ПланП_ПланПроизводстваНаПериод.ПланПроизводстваПоРесурсам.(
	|		НомерСтроки,
	|		ЗаказНаПроизводство,
	|		Заказ,
	|		Клиент,
	|		ЭтапПроизводства,
	|		РесурсПредприятия,
	|		Старт,
	|		Финиш
	|	)
	|ИЗ
	|	Документ.ПланП_ПланПроизводстваНаПериод КАК ПланП_ПланПроизводстваНаПериод
	|ГДЕ
	|	ПланП_ПланПроизводстваНаПериод.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПланПроизводстваПоРесурсамШапка = Макет.ПолучитьОбласть("ПланПроизводстваПоРесурсамШапка");
	ОбластьПланПроизводстваПоРесурсам = Макет.ПолучитьОбласть("ПланПроизводстваПоРесурсам");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПланПроизводстваПоРесурсамШапка);
		ВыборкаПланПроизводстваПоРесурсам = Выборка.ПланПроизводстваПоРесурсам.Выбрать();
		Пока ВыборкаПланПроизводстваПоРесурсам.Следующий() Цикл
			ОбластьПланПроизводстваПоРесурсам.Параметры.Заполнить(ВыборкаПланПроизводстваПоРесурсам);
			ТабДок.Вывести(ОбластьПланПроизводстваПоРесурсам, ВыборкаПланПроизводстваПоРесурсам.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
